class Url:
    QA_SCOOTER_SERVICE = "https://qa-scooter.praktikum-services.ru/"
    DZEN = 'https://dzen.ru/?yredirect=true'


class Data:
    name = 'Евгений',
    surname = 'Евгеньев'
    adresse = 'Москва'
    subway = 'Войковская'
    phone = '79161232234'
    date = '22.09.2024'
    comment = 'Жду'

    name_second = 'Джон',
    surname_second = 'Смит',
    adresse_second = 'Лондон',
    subway_second = 'Сокол',
    phone_second = '79261232234',
    date_second = '23.09.2024',
    comment_second = 'Очень нужен'


class MainData:
    SUCCES_POPUP = 'Заказ оформлен'

    ANSWER_TEXT = 'Сутки — 400 рублей. Оплата курьеру — наличными или картой.'
    ANSWER_TEXT_SECOND = ('Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, '
                          'можете просто сделать несколько заказов — один за другим.'),
    ANSWER_TEXT_THIRD = ('Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. '
                         'Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. '
                         'Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30.')
    ANSWER_TEXT_FOURTH = 'Только начиная с завтрашнего дня. Но скоро станем расторопнее.'
    ANSWER_TEXT_FIFTH = 'Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010.'
    ANSWER_TEXT_SIXTH = ('Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься '
                         'без передышек и во сне. Зарядка не понадобится.')
    ANSWER_TEXT_SEVENTH = 'Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои.'
    ANSWER_TEXT_EIGHTH = 'Да, обязательно. Всем самокатов! И Москве, и Московской области.'
